from flask import Flask, request, send_file, render_template, jsonify
import pandas as pd
import os
import re
import swifter
from werkzeug.utils import secure_filename

app = Flask(__name__)
UPLOAD_FOLDER = 'uploads'
PROCESSED_FOLDER = 'processed'
ALLOWED_EXTENSIONS = {'csv'}

app.config['UPLOAD_FOLDER'] = UPLOAD_FOLDER
app.config['PROCESSED_FOLDER'] = PROCESSED_FOLDER

os.makedirs(UPLOAD_FOLDER, exist_ok=True)
os.makedirs(PROCESSED_FOLDER, exist_ok=True)

def allowed_file(filename):
    return '.' in filename and filename.rsplit('.', 1)[1].lower() in ALLOWED_EXTENSIONS

def normalize_whitespace(text):
    if isinstance(text, str):
        text = text.replace('\u00A0', ' ')
        text = re.sub(r'[\u200B-\u200D\uFEFF]', '', text)
        text = re.sub(r'\s+', ' ', text).strip()
        text = re.sub(r'\s*\.\s*', '.', text)
        return text
    return text

# Ensure "Additional Area" is extracted first to prevent duplicate detection
patterns_1 = {
    "Enclosed Balcony": r"(Enclosed Balcony(?::)?|Closed Balcony\s*\/\s*Balcony Area\s*(?::)?|\+?एनक्लोजड\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?|आच्छादित\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इन्कोल्ज्ड|इंनक्लोज्ड)\s*\/?\s*(?:बंदिस्त|बंधिस्त)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड|येन्क्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(बंदिस्त|बंधिस्त|बंदिस्थ)\s*(?:व)?\s*(?:आच्छादित)?\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(?:चौ.मी.,)?(बंदिस्त|बंधिस्त|इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड|येन्क्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|\,?एनक्लोज\s*बाल्कनी\s*क्षेत्र|एनक्लोज्ड\s*बाल्कनी\s*यांसी\s*क्षेत्र\s*\-?|बंदिस्त\s*बाल्कनी(एन्क्लोज्ड\s*बाल्कनी)यांसी\s*कारपेट\s*क्षेत्र)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    "Dry Balcony": r"(Dry Balcony(?::)?|Utility Area(?::)?|उपयोगिता\s*क्षेत्र|(ड्राय|सर्विस|युटिलिटी|युटीलीट|युटीलिटी|वाशिंग|वॉशिंग|वॉशींग|वॉश)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:एरिया)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    "Open Balcony": r"(Open Balcony(?::)?|(?:ओपन|खुली)?\s*(बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:आऊट|आउट)?\s*(?:चे)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)\s*(?:-?\s*(1|2|3))?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|((बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)(?:\()?\s*ओपन(?:\))?)\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(वरंडा|व्हरंडा|व्हरांडा|वर्हांडा|वरांडा)\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(सीटाउट(?:स्)?|सिट\s*(?:-)?आउट(?:स्)?|सिट\s*(?:-)?आऊट(?:स्)?|सीट\s*(?:-)?आउट(?:स्)?|सीट\s*(?:-)?आऊट(?:स्)?)\s*(?:चे)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इतर|इत्तर)\s*लगत\s*चे\s*क्षेत्र\-?|(एक्सक्लुसिव|एक्स्ल्युजीव्ह|एक्सक्लूसिव्ह|एक्सक्लुसिव्ह)\s*क्षेत्र\s*\(?\s*बाल्कनी\s*\)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    "Terrace": r"(Terrace\s*(?:Above)?(?::)?|(Attached Terrace \/ Terrace \/ Cupboards Area)(?::)?|(टेरस|टेरेस|गच्ची|डेक)\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:ज्यासी)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:चे)?\s*(?:अँट\s*आय\s*लेवल)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:\s*,?\s*(यांसी|यासी))?\s*(?:कार्पेट|कारपेट|चटई)?\s*?\s*(?:बिल्ट\s*अप|बिल्टटप|बिल्ट-अप)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?\s*(?:(\d+(?:\.\d+)?)\s*क्षेत्र)?|(टेरस|टेरेस|गच्ची|डेक)\s*-?\s*(?:1|2|3)?\s*(?:1\s*व\s*2)?\s*(?:(?:\s*,\s*)?यांसी|यासी)\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:चे)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:\s*,?\s*(यांसी|यासी))?\s*(?:कार्पेट|कारपेट|चटई)?\s*?\s*(?:बिल्ट\s*अप|बिल्टटप|बिल्ट-अप)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?\s*(?:(\d+(?:\.\d+)?)\s*क्षेत्र)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    "Architechtural Projection": r"(Proportionate\s*Area(?::)?|(आर्किटेक्चरल\s*प्रोजेक्शन)\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    "EBVT": r"(Exclusive Area(?::)?|(इबीव्हीटी|ईबीव्हीटी)\s*(?:एरिया)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,व्हरांडा,इ.,यांसी\s*क्षेत्र|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,इ.,यांसी\s*क्षेत्र|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,व्हरांडा\s*इ.,यांसी\s*क्षेत्र)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
}


patterns_2 = {
    "Enclosed Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई)?\s*(आच्छादित\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?)|(?:कार्पेट|कारपेट|चटई)?\s*(इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)|(?:कार्पेट|कारपेट|चटई)?\s*(बंदिस्त|बंधिस्त|बंदिस्थ)\s*(?:व)?\s*(?:आच्छादित)?\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?)",
    "Dry Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((ड्राय|सर्विस|युटिलिटी|युटीलीट|युटीलिटी|वाशिंग|वॉशिंग|वॉशींग|वॉश)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि))",
    "Open Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई|अटॅचड)?\s*((बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्)|(सीटाउट|एक्सक्लुसिव|एक्स्ल्युजीव्ह|एक्सक्लूसिव्ह|सिट\s*आउट|सिट\s*आऊट|सीट\s*आउट|सीट\s*आऊट)))",
    "Terrace": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई)?\s*(टेरस|टेरेस|गच्ची|डेक))",
    #"Architechtural Projection": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*",
    #"EBVT": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*",
}


def convert_to_sqm(value, unit):
    try:
        if value and unit:
            value = float(value)
            unit_lower = unit.lower().strip()
            if unit_lower in ["फुट", "feet", "ft","चौ.फूट","चौ फु","चौ.फुट.","चौ.फुट","फुट","फुट.","फूट","फूट.","फू.","फू","फु.","फु","चौरसफुट","चौरसफुट.","चौरसफूट","चौरसफूट.","चौरसफू.","चौरसफू","चौरसफु.","चौरसफु","चौरस फुट","चौरस फुट.","चौरस फूट","चौरस फूट.","चौरस फू.","चौरस फू","चौरस फु.","चौरस फु","चौ.फुट","चौ.फुट.","चौ.फूट","चौ.फूट.","चौ.फू.","चौ.फू","चौ.फु.","चौ.फु","चौफुट","चौफुट.","चौफूट","चौफूट.","चौफू.","चौफू","चौफु.","चौफु","चौ. फुट","चौ. फुट.","चौ. फूट","चौ. फूट.","चौ. फू.","चौ. फू","चौ. फु.","चौ. फु","चौ फुट","चौ फुट.","चौ फूट","चौ फूट.","चौ फू.","चौ फू","चौ फु.","चौ फु","चौ .फुट","चौ .फुट.","चौ .फूट","चौ .फूट.","चौ .फू.","चौ .फू","चौ .फु.","चौ .फु","स्के. फूट.","स्के. फुट.","स्के.फूट.","स्के.फुट.","स्के.फू.","स्के.फु.","स्के.फू","स्के.फु","चौ . फुट"]:
                return round(value / 10.7639, 2)
            return round(value, 2)
        else:
            return None
    except ValueError:
        return None

def extract_areas(text, patterns_1, patterns_2, df):
    extracted_areas = {col: "" for col in ["Enclosed Balcony", "Dry Balcony", "Open Balcony", "Terrace", "EBVT", "Architechtural Projection"]}

    if pd.isna(text):
        return extracted_areas

    assigned_values = {"Enclosed Balcony": [], "Dry Balcony": []}

    row = df.loc[df['property_description'] == text]
    extracted_area_sqft = (round(row['extracted_area_sqft'].values[0] / 10.7639, 2)) if 'extracted_area_sqft' in df.columns and not row.empty else 0
    area_sqft = (round(row['area_sqft'].values[0] / 10.7639, 2)) if 'area_sqft' in df.columns and not row.empty else 0
    reference_area = extracted_area_sqft if extracted_area_sqft != 0 else area_sqft

    def process_patterns(area_type, patterns_1, patterns_2, seen_values, assigned_values=None):
        area_values = []
        found_values_pattern1 = False

        matches_1 = re.finditer(patterns_1.get(area_type, ""), text, re.IGNORECASE)
        for match in matches_1:
            groups = match.groups()
            if len(groups) >= 2:
                value, unit = groups[-2], groups[-1]
                converted_value = convert_to_sqm(value, unit)

                if reference_area != 0 and (converted_value is None or converted_value >= 0.9 * reference_area):
                    continue

                if converted_value is not None and converted_value not in seen_values:
                    area_values.append(converted_value)
                    seen_values.add(converted_value)
                    found_values_pattern1 = True

        if not found_values_pattern1:
            matches_2 = re.finditer(patterns_2.get(area_type, ""), text, re.IGNORECASE)
            for match in matches_2:
                groups = match.groups()
                if len(groups) >= 2:
                    value, unit = groups[0], groups[1]
                    converted_value = convert_to_sqm(value, unit)

                    if reference_area != 0 and (converted_value is None or converted_value >= 0.9 * reference_area):
                        continue

                    if converted_value is not None and converted_value not in seen_values:
                        area_values.append(converted_value)
                        seen_values.add(converted_value)

        return area_values

    for area_type in ["Enclosed Balcony", "Dry Balcony", "Terrace", "EBVT", "Architechtural Projection"]:
        seen_values = set()
        area_values = process_patterns(area_type, patterns_1, patterns_2, seen_values)
        extracted_areas[area_type] = sum(area_values) if area_values else ""
        if area_type in assigned_values:
            assigned_values[area_type] = area_values

    # Process Open Balcony separately with duplicate prevention
    seen_open_values = set()
    open_area_values = process_patterns("Open Balcony", patterns_1, patterns_2, seen_open_values)
    final_open_area_values = []

    for val in open_area_values:
        if val not in assigned_values["Enclosed Balcony"] and val not in assigned_values["Dry Balcony"]:
            final_open_area_values.append(val)
            seen_open_values.add(val)

    extracted_areas["Open Balcony"] = sum(final_open_area_values) if final_open_area_values else ""

    additional_area_regex = {}
    has_values = False
    for key, value in extracted_areas.items():
        if key in ["Open Balcony", "Terrace", "Dry Balcony", "Enclosed Balcony", "EBVT", "Architechtural Projection"] and value != "":
            has_values = True
            additional_area_regex[key.lower().replace(" ", "_")] = f"{value} sq. mtr."

    if has_values:
        extracted_areas["additional_area_regex"] = additional_area_regex
    else:
        extracted_areas["additional_area_regex"] = ""

    return extracted_areas

def process_csv_data(df):
    columns_to_process = ['property_description']
    df['property_description'] = df['property_description'].astype(str).apply(normalize_whitespace)

    patterns_1 = {
        "Enclosed Balcony": r"(Enclosed Balcony(?::)?|Closed Balcony\s*\/\s*Balcony Area\s*(?::)?|\+?एनक्लोजड\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?|आच्छादित\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इन्कोल्ज्ड|इंनक्लोज्ड)\s*\/?\s*(?:बंदिस्त|बंधिस्त)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड|येन्क्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(बंदिस्त|बंधिस्त|बंदिस्थ)\s*(?:व)?\s*(?:आच्छादित)?\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(?:चौ.मी.,)?(बंदिस्त|बंधिस्त|इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड|येन्क्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|\,?एनक्लोज\s*बाल्कनी\s*क्षेत्र|एनक्लोज्ड\s*बाल्कनी\s*यांसी\s*क्षेत्र\s*\-?|बंदिस्त\s*बाल्कनी(एन्क्लोज्ड\s*बाल्कनी)यांसी\s*कारपेट\s*क्षेत्र)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
        "Dry Balcony": r"(Dry Balcony(?::)?|Utility Area(?::)?|उपयोगिता\s*क्षेत्र|(ड्राय|सर्विस|युटिलिटी|युटीलीट|युटीलिटी|वाशिंग|वॉशिंग|वॉशींग|वॉश)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:एरिया)?\s*(?:चे)?\s*(?:यांसी|यासी)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
        "Open Balcony": r"(Open Balcony(?::)?|(?:ओपन|खुली)?\s*(बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:आऊट|आउट)?\s*(?:चे)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)\s*(?:-?\s*(1|2|3))?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|((बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्|बाल्कणि)(?:\()?\s*ओपन(?:\))?)\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(वरंडा|व्हरंडा|व्हरांडा|वर्हांडा|वरांडा)\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(सीटाउट(?:स्)?|सिट\s*(?:-)?आउट(?:स्)?|सिट\s*(?:-)?आऊट(?:स्)?|सीट\s*(?:-)?आउट(?:स्)?|सीट\s*(?:-)?आऊट(?:स्)?)\s*(?:चे)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:\d+\.\d+\s*म्हणजेच)?|(इतर|इत्तर)\s*लगत\s*चे\s*क्षेत्र\-?|(एक्सक्लुसिव|एक्स्ल्युजीव्ह|एक्सक्लूसिव्ह|एक्सक्लुसिव्ह)\s*क्षेत्र\s*\(?\s*बाल्कनी\s*\)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
        "Terrace": r"(Terrace\s*(?:Above)?(?::)?|(Attached Terrace \/ Terrace \/ Cupboards Area)(?::)?|(टेरस|टेरेस|गच्ची|डेक)\s*(?:क्षेञ|क्षेत्र(?:फळ)?)?\s*(?:ज्यासी)?\s*(?:एरिया)?\s*(?:(?:\s*,\s*)?यांसी|यासी)?\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:चे)?\s*(?:अँट\s*आय\s*लेवल)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:\s*,?\s*(यांसी|यासी))?\s*(?:कार्पेट|कारपेट|चटई)?\s*?\s*(?:बिल्ट\s*अप|बिल्टटप|बिल्ट-अप)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?\s*(?:(\d+(?:\.\d+)?)\s*क्षेत्र)?|(टेरस|टेरेस|गच्ची|डेक)\s*-?\s*(?:1|2|3)?\s*(?:1\s*व\s*2)?\s*(?:(?:\s*,\s*)?यांसी|यासी)\s*(?:असे)?\s*(?:एकूण|एकुण)?\s*(?:चे)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:\s*,?\s*(यांसी|यासी))?\s*(?:कार्पेट|कारपेट|चटई)?\s*?\s*(?:बिल्ट\s*अप|बिल्टटप|बिल्ट-अप)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?\s*(?:(\d+(?:\.\d+)?)\s*क्षेत्र)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
        "Architechtural Projection": r"(Proportionate\s*Area(?::)?|(आर्किटेक्चरल\s*प्रोजेक्शन)\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
        "EBVT": r"(Exclusive Area(?::)?|(इबीव्हीटी|ईबीव्हीटी)\s*(?:एरिया)?\s*(?:कार्पेट|कारपेट|चटई)?\s*(?:एरिया)?\s*(?:क्षेत्रा\,?|क्षेञ\,?|क्षेत्र\,?(?:फळ)?)?\.?\s*(?:-)?\s*(?:\d+\.\d+\s*म्हणजेच)?|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,व्हरांडा,इ.,यांसी\s*क्षेत्र|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,इ.,यांसी\s*क्षेत्र|सीट\s*आऊट,ड्राय\s*बाल्कनी,एनक्लोज\s*बाल्कनी,व्हरांडा\s*इ.,यांसी\s*क्षेत्र)\s*(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरस|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट\s*.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)",
    }

    patterns_2 = {
        "Enclosed Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई)?\s*(आच्छादित\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?)|(?:कार्पेट|कारपेट|चटई)?\s*(इन्कोल्ज्ड|एनक्लोज|एन्क्लोजड|एन्क्लोज्ड|इंनक्लोज्ड|इनक्लोज|एनक्लोजड|एनक्लोस्ड)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)|(?:कार्पेट|कारपेट|चटई)?\s*(बंदिस्त|बंधिस्त|बंदिस्थ)\s*(?:व)?\s*(?:आच्छादित)?\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि)?)",
        "Dry Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((ड्राय|सर्विस|युटिलिटी|युटीलीट|युटीलिटी|वाशिंग|वॉशिंग|वॉशींग|वॉश)\s*(?:बालकनी|बाल्कनी|बाल्कणी|बाल्कणि))",
        "Open Balcony": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई|अटॅचड)?\s*((बालकनी|बाल्कनी|बाल्कणी|बाल्कनीज्)|(सीटाउट|एक्सक्लुसिव|एक्स्ल्युजीव्ह|एक्सक्लूसिव्ह|सिट\s*आउट|सिट\s*आऊट|सीट\s*आउट|सीट\s*आऊट)))",
        "Terrace": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*((?:कार्पेट|कारपेट|चटई)?\s*(टेरस|टेरेस|गच्ची|डेक))",
        #"Architechtural Projection": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*",
        #"EBVT": r"(\d+(?:\.\d+)?)(?:.?)\s*(मी\.?|चौ\?.|चौरसमी.|चौरसमी|चौरसमीटर|चौरसफुट|चौरसफुट.|चौरसफूट|चौरसफूट.|चौरसफू.|चौरसफू|चौरसफु.|चौरसफु|चौरस\s*मी.|चौरस\s*मी|चौरस\s*मीटर|चौरस\s*फुट|चौरस\s*फुट.|चौरस\s*फूट|चौरस\s*फूट.|चौरस\s*फू.|चौरस\s*फू|चौरस\s*फु.|चौरस\s*फु|चौ\.मी|चौ.मी.|चौ.मी|चौ.मीटर|चौ\s*.\s*फुट|चौ\s*.\s*फुट.|चौ.फूट|चौ.फूट.|चौ.फू.|चौ.फू|चौ.फु.|चौ.फु|चौ.\s*मी.|चौ.\s*मी|चौ.\s*मीटर|चौ.\s*फुट|चौ.\s*फुट.|चौ.\s*फूट|चौ.\s*फूट.|चौ.\s*फू.|चौ.\s*फू|चौ.\s*फु.|चौ.\s*फु|चौमी.|चौमी|चौमीटर|चौफुट|चौफुट.|चौफूट|चौफूट.|चौफू.|चौफू|चौफु.|चौफु|चौ\s*मी.|चौ\s*मी|चौ\s*मीटर|चौ\s*फुट|चौ\s*फुट.|चौ\s*फूट|चौ\s*फूट.|चौ\s*फू.|चौ\s*फू|चौ\s*फु.|चौ\s*फु|चौ\s*.मी.|चौ\s*.मी.|चौ\s*.मी|चौ\s*.मीटर|चौ\s*.फुट|चौ\s*.फुट.|चौ\s*.फूट|चौ\s*.फूट.|चौ\s*.फू.|चौ\s*.फू|चौ\s*.फु.|चौ\s*.फु|चौ.\s*मी.\)|चौ.मि.|चौ.मि.\)|.चौ.मी|चौ मि|चौ. मी.?,|स्के. फूट.|चौ . मी .\/\?|चौरस मिटर|चौ\.?मी\.?(?:\s*म्हणजेच)?|स्के. फूट.|स्के. फुट.|स्के.फूट.|स्के.फुट.|स्के.फू.|स्के.फु.|स्के.फू|स्के.फु|Square Meter)\s*",

    }

    if 'property_description' in df.columns:
        chunk_size = 10000
        results = []

        for i in range(0, len(df), chunk_size):
            chunk = df[i:i + chunk_size].copy()
            def extract_areas_series(text, patterns_1, patterns_2, chunk):
                if pd.isna(text):
                    return pd.Series({})
                extracted_data = extract_areas(str(text), patterns_1, patterns_2, chunk)
                return pd.Series(extracted_data)

            extracted_df = chunk['property_description'].swifter.apply(lambda x: extract_areas_series(x, patterns_1, patterns_2, chunk))
            chunk = pd.concat([chunk, extracted_df], axis=1)
            results.append(chunk)

        df = pd.concat(results, ignore_index=True)
    else:
        for area_type in set(patterns_1.keys()).union(set(patterns_2.keys())):
            df[area_type] = None

    columns_to_check = ["Open Balcony", "Terrace", "Dry Balcony", "Enclosed Balcony", "EBVT", "Architechtural Projection"]
    df['Flag'] = ''
    for index, row in df.iterrows():
        values = [row[col] for col in columns_to_check if pd.notna(row[col])]
        rounded_values = [round(float(value), 2) for value in values if value != ""]
        if len(rounded_values) != len(set(rounded_values)) and len(rounded_values) > 1:
            df.loc[index, 'Flag'] = 'check'

    return df

@app.route('/', methods=['GET'])
def index():
    return render_template('index.html')

@app.route('/process', methods=['POST'])
def process_file():
    if 'file' not in request.files:
        return jsonify({'error': 'No file part'}), 400
    file = request.files['file']
    if file.filename == '':
        return jsonify({'error': 'No selected file'}), 400
    if file and allowed_file(file.filename):
        filename = secure_filename(file.filename)
        file_path = os.path.join(app.config['UPLOAD_FOLDER'], filename)
        file.save(file_path)
        try:
            df = pd.read_csv(file_path, encoding='utf-8')
            processed_df = process_csv_data(df.copy())
            excel_filename = 'processed_data.xlsx'
            excel_file_path = os.path.join(app.config['PROCESSED_FOLDER'], excel_filename)

            # Write Excel using a context manager to ensure it's fully flushed
            with pd.ExcelWriter(excel_file_path, engine='openpyxl') as writer:
                processed_df.to_excel(writer, index=False)

            # Send the file
            return send_file(excel_file_path, as_attachment=True, download_name=excel_filename)

        except Exception as e:
            return jsonify({'error': str(e)}), 500

        finally:
            if os.path.exists(file_path):
                os.remove(file_path)
    return jsonify({'error': 'Invalid file type'}), 400

if __name__ == '__main__':
    app.run(debug=True)
